#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
local_file.k3s_ansible_host_cloud_config: Refreshing state... [id=726099b53168c8bf93aab0585c5f2776c3fd34f2]
null_resource.always_run: Refreshing state... [id=6306844588324122063]
null_resource.k3s_ansible_host_cloud_config_ssh_file_provisioner: Refreshing state... [id=4425854409431662058]
proxmox_lxc.k3s-lb-3: Refreshing state... [id=milky-polaris/lxc/12003]
proxmox_lxc.k3s-lb-1: Refreshing state... [id=milky-capella/lxc/12001]
proxmox_lxc.cloudflare-tunnel-solufit-3: Refreshing state... [id=milky-polaris/lxc/2007]
proxmox_vm_qemu.k8s-play-manager-ansible-host: Refreshing state... [id=milky-capella/qemu/30000]
proxmox_vm_qemu.k3s-manager-worker-2: Refreshing state... [id=milky-polaris/qemu/11001]
proxmox_vm_qemu.k8s-play-worker: Refreshing state... [id=milky-polaris/qemu/32000]
proxmox_vm_qemu.k3s-manager-worker-1: Refreshing state... [id=milky-capella/qemu/11000]
proxmox_vm_qemu.k3s-manager-controller-3: Refreshing state... [id=milky-polaris/qemu/10002]
proxmox_vm_qemu.k8s-play-controller: Refreshing state... [id=milky-capella/qemu/31000]
proxmox_vm_qemu.cloudflare-tunnel-solufit-4: Refreshing state... [id=milky-carina/qemu/2006]
proxmox_vm_qemu.k3s-manager-controller-1: Refreshing state... [id=milky-capella/qemu/10000]
proxmox_lxc.cloudflare-tunnel-solufit-2: Refreshing state... [id=milky-carina/lxc/2004]
proxmox_vm_qemu.k3s-manager-worker-3: Refreshing state... [id=milky-carina/qemu/11002]
proxmox_lxc.k3s-lb-2: Refreshing state... [id=milky-carina/lxc/12002]
proxmox_lxc.cloudflare-tunnel-solufit-1: Refreshing state... [id=milky-capella/lxc/2003]
proxmox_vm_qemu.k3s-manager-controller-2: Refreshing state... [id=milky-carina/qemu/10001]
proxmox_vm_qemu.k3s-manager-ansible-host: Refreshing state... [id=milky-capella/qemu/1000]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # null_resource.always_run will be destroyed
  # (because null_resource.always_run is not in configuration)
  - resource "null_resource" "always_run" {
      - id       = "6306844588324122063" -> null
      - triggers = {
          - "always_run" = "2025-01-12T07:52:26Z"
        } -> null
    }

  # null_resource.k3s_ansible_host_cloud_config_ssh_file_provisioner will be destroyed
  # (because null_resource.k3s_ansible_host_cloud_config_ssh_file_provisioner is not in configuration)
  - resource "null_resource" "k3s_ansible_host_cloud_config_ssh_file_provisioner" {
      - id = "4425854409431662058" -> null
    }

  # proxmox_lxc.cloudflare-tunnel-solufit-1 must be replaced
-/+ resource "proxmox_lxc" "cloudflare-tunnel-solufit-1" {
      - bwlimit              = 0 -> null
      ~ description          = <<-EOT
            cloudflare tunnel for Solufit
        EOT
      - force                = false -> null
      ~ id                   = "milky-carina/lxc/2003" -> (known after apply)
      - ignore_unpack_errors = false -> null
      ~ ostype               = "ubuntu" -> (known after apply)
      - restore              = false -> null
      + tags                 = (known after apply)
      ~ target_node          = "milky-carina" -> "milky-capella" # forces replacement
      - template             = false -> null
      - unique               = false -> null
      ~ unprivileged         = true -> false
      ~ unused               = [] -> (known after apply)
        # (23 unchanged attributes hidden)

      ~ network {
          ~ hwaddr   = "BC:24:11:46:B8:71" -> (known after apply)
          ~ id       = 0 -> (known after apply)
          - mtu      = 0 -> null
            name     = "eth0"
          - rate     = 0 -> null
          ~ tag      = 0 -> (known after apply)
          + trunks   = (known after apply)
          ~ type     = "veth" -> (known after apply)
            # (6 unchanged attributes hidden)
        }
      ~ network {
          ~ hwaddr   = "BC:24:11:B1:44:73" -> (known after apply)
          ~ id       = 1 -> (known after apply)
            name     = "eth1"
          - rate     = 0 -> null
          ~ tag      = 0 -> (known after apply)
          + trunks   = (known after apply)
          ~ type     = "veth" -> (known after apply)
            # (7 unchanged attributes hidden)
        }

      ~ rootfs {
          - acl       = false -> null
          - quota     = false -> null
          - replicate = false -> null
          - ro        = false -> null
          - shared    = false -> null
          ~ volume    = "local-lvm:vm-2003-disk-0" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # proxmox_lxc.cloudflare-tunnel-solufit-2 must be replaced
-/+ resource "proxmox_lxc" "cloudflare-tunnel-solufit-2" {
      - bwlimit              = 0 -> null
      ~ description          = <<-EOT
            cloudflare tunnel for Solufit
        EOT
      - force                = false -> null
      ~ id                   = "milky-polaris/lxc/2004" -> (known after apply)
      - ignore_unpack_errors = false -> null
      ~ ostype               = "ubuntu" -> (known after apply)
      - restore              = false -> null
      + tags                 = (known after apply)
      ~ target_node          = "milky-polaris" -> "milky-carina" # forces replacement
      - template             = false -> null
      - unique               = false -> null
      ~ unprivileged         = true -> false
      ~ unused               = [] -> (known after apply)
        # (23 unchanged attributes hidden)

      ~ network {
          ~ hwaddr   = "BC:24:11:AC:AC:58" -> (known after apply)
          ~ id       = 0 -> (known after apply)
          - mtu      = 0 -> null
            name     = "eth0"
          - rate     = 0 -> null
          ~ tag      = 0 -> (known after apply)
          + trunks   = (known after apply)
          ~ type     = "veth" -> (known after apply)
            # (6 unchanged attributes hidden)
        }
      ~ network {
          ~ hwaddr   = "BC:24:11:16:28:1C" -> (known after apply)
          ~ id       = 1 -> (known after apply)
            name     = "eth1"
          - rate     = 0 -> null
          ~ tag      = 0 -> (known after apply)
          + trunks   = (known after apply)
          ~ type     = "veth" -> (known after apply)
            # (7 unchanged attributes hidden)
        }

      ~ rootfs {
          - acl       = false -> null
          - quota     = false -> null
          - replicate = false -> null
          - ro        = false -> null
          - shared    = false -> null
          ~ volume    = "local-lvm:vm-2004-disk-0" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # proxmox_lxc.cloudflare-tunnel-solufit-3 will be updated in-place
  ~ resource "proxmox_lxc" "cloudflare-tunnel-solufit-3" {
      ~ description          = <<-EOT
            cloudflare tunnel for Solufit
        EOT
        id                   = "milky-polaris/lxc/2007"
        tags                 = null
      ~ unprivileged         = true -> false
        # (32 unchanged attributes hidden)

      ~ network {
            id       = 0
          - mtu      = 1400 -> null
            name     = "eth0"
            # (11 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # proxmox_lxc.k3s-lb-1 will be destroyed
  # (because proxmox_lxc.k3s-lb-1 is not in configuration)
  - resource "proxmox_lxc" "k3s-lb-1" {
      - arch                 = "amd64" -> null
      - bwlimit              = 0 -> null
      - clone                = "9100" -> null
      - cmode                = "tty" -> null
      - console              = true -> null
      - cores                = 1 -> null
      - cpulimit             = 0 -> null
      - cpuunits             = 1024 -> null
      - description          = <<-EOT
            cloudflare tunnel for Solufit
        EOT -> null
      - force                = false -> null
      - hostname             = "solufit-k3s-lb-1" -> null
      - id                   = "milky-carina/lxc/12001" -> null
      - ignore_unpack_errors = false -> null
      - memory               = 256 -> null
      - onboot               = true -> null
      - ostype               = "ubuntu" -> null
      - pool                 = "solufit" -> null
      - protection           = false -> null
      - restore              = false -> null
      - start                = true -> null
      - swap                 = 0 -> null
        tags                 = null
      - target_node          = "milky-carina" -> null
      - template             = false -> null
      - tty                  = 2 -> null
      - unique               = false -> null
      - unprivileged         = true -> null
      - unused               = [] -> null
      - vmid                 = 12001 -> null
        # (7 unchanged attributes hidden)

      - network {
          - bridge   = "k3s" -> null
          - firewall = false -> null
          - hwaddr   = "BC:24:11:1F:F0:17" -> null
          - id       = 0 -> null
          - ip       = "10.100.0.6/24" -> null
          - mtu      = 0 -> null
          - name     = "eth0" -> null
          - rate     = 0 -> null
          - tag      = 0 -> null
          - type     = "veth" -> null
            # (4 unchanged attributes hidden)
        }
      - network {
          - bridge   = "vmbr2" -> null
          - firewall = false -> null
          - hwaddr   = "BC:24:11:EC:03:6F" -> null
          - id       = 1 -> null
          - ip       = "dhcp" -> null
          - mtu      = 1400 -> null
          - name     = "eth1" -> null
          - rate     = 0 -> null
          - tag      = 0 -> null
          - type     = "veth" -> null
            # (4 unchanged attributes hidden)
        }

      - rootfs {
          - acl       = false -> null
          - quota     = false -> null
          - replicate = false -> null
          - ro        = false -> null
          - shared    = false -> null
          - size      = "8G" -> null
          - storage   = "local-lvm" -> null
          - volume    = "local-lvm:vm-12001-disk-0" -> null
        }
    }

  # proxmox_lxc.k3s-lb-2 must be replaced
-/+ resource "proxmox_lxc" "k3s-lb-2" {
      - bwlimit              = 0 -> null
      ~ description          = <<-EOT
            cloudflare tunnel for Solufit
        EOT
      - force                = false -> null
      ~ id                   = "milky-carina/lxc/12002" -> (known after apply)
      - ignore_unpack_errors = false -> null
      ~ ostype               = "ubuntu" -> (known after apply)
      - restore              = false -> null
      + tags                 = (known after apply)
      - template             = false -> null
      - unique               = false -> null
      ~ unprivileged         = true -> false
      ~ unused               = [] -> (known after apply)
        # (24 unchanged attributes hidden)

      ~ network {
          ~ hwaddr   = "BC:24:11:DE:B0:BA" -> (known after apply)
          ~ id       = 0 -> (known after apply)
          - mtu      = 0 -> null
            name     = "eth0"
          - rate     = 0 -> null
          ~ tag      = 0 -> (known after apply)
          + trunks   = (known after apply)
          ~ type     = "veth" -> (known after apply)
            # (6 unchanged attributes hidden)
        }
      ~ network {
          ~ hwaddr   = "BC:24:11:72:D8:50" -> (known after apply)
          ~ id       = 1 -> (known after apply)
            name     = "eth1"
          - rate     = 0 -> null
          ~ tag      = 0 -> (known after apply)
          + trunks   = (known after apply)
          ~ type     = "veth" -> (known after apply)
            # (7 unchanged attributes hidden)
        }

      ~ rootfs {
          - acl       = false -> null
          - quota     = false -> null
          - replicate = false -> null
          - ro        = false -> null
          - shared    = false -> null
          ~ storage   = "local-lvm" -> "main-storage" # forces replacement
          ~ volume    = "local-lvm:vm-12002-disk-0" -> (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # proxmox_lxc.k3s-lb-3 must be replaced
-/+ resource "proxmox_lxc" "k3s-lb-3" {
      - bwlimit              = 0 -> null
      ~ description          = <<-EOT
            cloudflare tunnel for Solufit
        EOT
      - force                = false -> null
      ~ id                   = "milky-polaris/lxc/12003" -> (known after apply)
      - ignore_unpack_errors = false -> null
      ~ ostype               = "ubuntu" -> (known after apply)
      - restore              = false -> null
      + tags                 = (known after apply)
      - template             = false -> null
      - unique               = false -> null
      ~ unprivileged         = true -> false
      ~ unused               = [] -> (known after apply)
        # (24 unchanged attributes hidden)

      ~ network {
          ~ hwaddr   = "BC:24:11:55:AB:EB" -> (known after apply)
          ~ id       = 0 -> (known after apply)
          - mtu      = 0 -> null
            name     = "eth0"
          - rate     = 0 -> null
          ~ tag      = 0 -> (known after apply)
          + trunks   = (known after apply)
          ~ type     = "veth" -> (known after apply)
            # (6 unchanged attributes hidden)
        }
      ~ network {
          ~ hwaddr   = "BC:24:11:3D:5D:EC" -> (known after apply)
          ~ id       = 1 -> (known after apply)
            name     = "eth1"
          - rate     = 0 -> null
          ~ tag      = 0 -> (known after apply)
          + trunks   = (known after apply)
          ~ type     = "veth" -> (known after apply)
            # (7 unchanged attributes hidden)
        }

      ~ rootfs {
          - acl       = false -> null
          - quota     = false -> null
          - replicate = false -> null
          - ro        = false -> null
          - shared    = false -> null
          ~ storage   = "local-lvm" -> "main-storage" # forces replacement
          ~ volume    = "local-lvm:vm-12003-disk-0" -> (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # proxmox_vm_qemu.cloudflare-tunnel-solufit-4 will be updated in-place
  ~ resource "proxmox_vm_qemu" "cloudflare-tunnel-solufit-4" {
      + bootdisk               = "scsi0"
        id                     = "milky-polaris/qemu/2006"
        name                   = "solufit-cloudflare-tunnel-4"
      ~ onboot                 = true -> false
        tags                   = null
        # (70 unchanged attributes hidden)

      ~ disks {
          ~ ide {
              ~ ide0 {
                  ~ cloudinit {
                      ~ storage = "data" -> "local-lvm"
                    }
                }
            }
          ~ scsi {
              ~ scsi0 {
                  ~ disk {
                        id                   = 0
                      ~ storage              = "data" -> "local-lvm"
                        # (23 unchanged attributes hidden)
                    }
                }
            }
        }

      - serial {
          - id   = 0 -> null
          - type = "socket" -> null
        }

        # (7 unchanged blocks hidden)
    }

  # proxmox_vm_qemu.k3s-manager-ansible-host must be replaced
-/+ resource "proxmox_vm_qemu" "k3s-manager-ansible-host" {
      + bootdisk               = "scsi0"
      - cicustom               = "vendor=cephfs:snippets/ansible-host-cloud-config.yaml" -> null # forces replacement
      + default_ipv4_address   = (known after apply)
      + default_ipv6_address   = (known after apply)
      ~ id                     = "milky-polaris/qemu/1000" -> (known after apply)
      ~ linked_vmid            = 0 -> (known after apply)
        name                   = "k3s-ansible-host"
      - numa                   = false -> null
      - qemu_os                = "other" -> null
      ~ reboot_required        = false -> (known after apply)
      + ssh_host               = (known after apply)
      + ssh_port               = (known after apply)
      + tags                   = (known after apply)
      ~ target_node            = "milky-capella" -> "milky-carina"
      ~ unused_disk            = [] -> (known after apply)
      ~ vm_state               = "stopped" -> "running"
        # (59 unchanged attributes hidden)

      ~ disks {
          ~ scsi {
              ~ scsi0 {
                  ~ disk {
                      - discard              = false -> null
                      - emulatessd           = false -> null
                      ~ id                   = 0 -> (known after apply)
                      - iothread             = false -> null
                      ~ linked_disk_id       = -1 -> (known after apply)
                      - readonly             = false -> null
                      - replicate            = false -> null
                      ~ storage              = "local-lvm" -> "main-storage"
                        # (17 unchanged attributes hidden)
                    }
                }
            }

            # (1 unchanged block hidden)
        }

      ~ network {
            id        = 0
          ~ macaddr   = "ae:54:41:70:57:c5" -> (known after apply)
          - queues    = 0 -> null
          - rate      = 0 -> null
          - tag       = 0 -> null
            # (5 unchanged attributes hidden)
        }
      ~ network {
            id        = 1
          ~ macaddr   = "22:7a:4f:dd:ae:f1" -> (known after apply)
          - mtu       = 0 -> null
          - queues    = 0 -> null
          - rate      = 0 -> null
          - tag       = 0 -> null
            # (4 unchanged attributes hidden)
        }

      ~ smbios {
          + additional_wait             = (known after apply)
          + agent                       = (known after apply)
          + agent_timeout               = (known after apply)
          + args                        = (known after apply)
          + automatic_reboot            = (known after apply)
          + balloon                     = (known after apply)
          + bios                        = (known after apply)
          + boot                        = (known after apply)
          + bootdisk                    = (known after apply)
          + ci_wait                     = (known after apply)
          + cicustom                    = (known after apply)
          + cipassword                  = (known after apply)
          + ciupgrade                   = (known after apply)
          + ciuser                      = (known after apply)
          + clone                       = (known after apply)
          + clone_id                    = (known after apply)
          + clone_wait                  = (known after apply)
          + cores                       = (known after apply)
          + cpu                         = (known after apply)
          + cpu_type                    = (known after apply)
          + default_ipv4_address        = (known after apply)
          + default_ipv6_address        = (known after apply)
          + define_connection_info      = (known after apply)
          + desc                        = (known after apply)
          + force_create                = (known after apply)
          + force_recreate_on_change_of = (known after apply)
          + full_clone                  = (known after apply)
          + hagroup                     = (known after apply)
          + hastate                     = (known after apply)
          + hotplug                     = (known after apply)
          + id                          = (known after apply)
          + ipconfig0                   = (known after apply)
          + ipconfig1                   = (known after apply)
          + ipconfig10                  = (known after apply)
          + ipconfig11                  = (known after apply)
          + ipconfig12                  = (known after apply)
          + ipconfig13                  = (known after apply)
          + ipconfig14                  = (known after apply)
          + ipconfig15                  = (known after apply)
          + ipconfig2                   = (known after apply)
          + ipconfig3                   = (known after apply)
          + ipconfig4                   = (known after apply)
          + ipconfig5                   = (known after apply)
          + ipconfig6                   = (known after apply)
          + ipconfig7                   = (known after apply)
          + ipconfig8                   = (known after apply)
          + ipconfig9                   = (known after apply)
          + kvm                         = (known after apply)
          + linked_vmid                 = (known after apply)
          + machine                     = (known after apply)
          + memory                      = (known after apply)
          + name                        = (known after apply)
          + nameserver                  = (known after apply)
          + numa                        = (known after apply)
          + onboot                      = (known after apply)
          + os_network_config           = (known after apply)
          + os_type                     = (known after apply)
          + pool                        = (known after apply)
          + protection                  = (known after apply)
          + pxe                         = (known after apply)
          + qemu_os                     = (known after apply)
          + reboot_required             = (known after apply)
          + scsihw                      = (known after apply)
          + searchdomain                = (known after apply)
          + skip_ipv4                   = (known after apply)
          + skip_ipv6                   = (known after apply)
          + sockets                     = (known after apply)
          + ssh_forward_ip              = (known after apply)
          + ssh_host                    = (known after apply)
          + ssh_port                    = (known after apply)
          + ssh_private_key             = (known after apply)
          + ssh_user                    = (known after apply)
          + sshkeys                     = (known after apply)
          + startup                     = (known after apply)
          + tablet                      = (known after apply)
          + tags                        = (known after apply)
          + target_node                 = (known after apply)
          + target_nodes                = (known after apply)
          + unused_disk                 = (known after apply)
          + vcpus                       = (known after apply)
          + vm_state                    = (known after apply)
          + vmid                        = (known after apply)
        } -> (known after apply)
    }

  # proxmox_vm_qemu.k3s-manager-controller-1 will be created
  + resource "proxmox_vm_qemu" "k3s-manager-controller-1" {
      + additional_wait        = 5
      + agent                  = 1
      + automatic_reboot       = true
      + balloon                = 0
      + bios                   = "seabios"
      + boot                   = "order=scsi0"
      + bootdisk               = "scsi0"
      + ciupgrade              = false
      + clone                  = "ubuntu2204-withdocker"
      + clone_wait             = 10
      + cores                  = 4
      + cpu_type               = "host"
      + default_ipv4_address   = (known after apply)
      + default_ipv6_address   = (known after apply)
      + define_connection_info = true
      + desc                   = "Management Kubernetes cluster for Solufit"
      + force_create           = false
      + full_clone             = true
      + hotplug                = "network,disk,usb"
      + id                     = (known after apply)
      + ipconfig0              = "ip=10.100.0.10/24"
      + ipconfig1              = "ip=dhcp"
      + kvm                    = true
      + linked_vmid            = (known after apply)
      + memory                 = 8192
      + name                   = "solufit-k3s-controller-1"
      + onboot                 = false
      + os_type                = "cloud-init"
      + pool                   = "solufit"
      + protection             = false
      + reboot_required        = (known after apply)
      + scsihw                 = "virtio-scsi-pci"
      + skip_ipv4              = false
      + skip_ipv6              = false
      + sockets                = 1
      + ssh_forward_ip         = "10.100.0.10"
      + ssh_host               = (known after apply)
      + ssh_port               = (known after apply)
      + ssh_user               = "ubuntu"
      + sshkeys                = <<-EOT
            ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDHnxwb9bBqio0ljUF/PrZJ6rejcBZFegnKndwRz85p9YuijN0tI3vslgTDY9eek26WXc1CMECaSvMoMpV3CalrIELV2RoTfXZOCtxkaoJxZcBpBIWAoM77h5cVusZT0znx7a9wSW4rmqFXaEHc2BMkWNDnV1w6ykpycyTUECEOq/xYqCtgUwrfGR1/cb3XTpAPZVbaEoZPXU9JfH6TR+9uKoZF7tovmXmMUkpjUn/prVUEPYBMaMKAFedtBWL7kexdStDxArTgfOj3QG+e1DOZ1IAkmxeBKg3hkQ56ECAz25NtS0DJqAEVP4EqPmTYerlsEN1Ousiw6AVz6Pzpo4OIYrCzg83DZ4eKbMr1w7cM9d3YclRIqqDOHtGgOf55mITBCz3kgHO6Id6kU62XyEcA9rcQdixOZMMMvzCBKWCaUord0A0OjabtXPQ6BeG1LBdp2oCWd0dPhehrKUHjRVuH5DfXtUf/UkOP4ElnU70c0YkxWZTs8hC+7BybkOcGePk= yuuta@yuuta-ThinkPadE14
            
            ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQC6ahvrz1GH0KxZhCVNwxWB1WJTOGBccLXDCIECzzC2mG4anVCjeZ5kyHCSvO2smASACUOouthlXq7xDXFETE/coKVe0fSnU6ApTjMW9q4U9Bsjvcx2G4YENxbgJAaIYiA8Dw3Zw2fBQUIkhxOhXgwREK0xl98n880uzIZ3PFOUu+NvNu8SoJOiVq8vgdft2EWajADS9L1DRh8OR0CnQo/RsNdL6O4RnbPGJCHPMutLKbdsazMBzPjZ4DgqF88+rC5DaAEXPlAZ1mHriZDEOlYQoOFTSwKcaYfjJvONY9zSWYgdEY5lsrMpJWD3u9FuvyiWaNPClArcWOd4zvE1z+WWDPEfVSt+pe6eMubf9nZ1/RPsP8mugX2jOaMFdMjWN4gMk+d4i/9QbRQynlOhVWo1LwmE04QIJRw6k4TNcs6The5fdwLXvx9QWI7CwOpUxvc6CxaN109yZBc8Se0GdX4djPs97H4wYSdBX6pWoastC5ludVYXlE13zSOE76BAnes= yuuta@yuuta-ThinkPadE14
        EOT
      + tablet                 = true
      + tags                   = (known after apply)
      + target_node            = "milky-carina"
      + unused_disk            = (known after apply)
      + vcpus                  = 0
      + vm_state               = "running"
      + vmid                   = 10000

      + disks {
          + ide {
              + ide0 {
                  + cloudinit {
                      + storage = "local-lvm"
                    }
                }
            }
          + scsi {
              + scsi0 {
                  + disk {
                      + backup               = true
                      + format               = "raw"
                      + id                   = (known after apply)
                      + iops_r_burst         = 0
                      + iops_r_burst_length  = 0
                      + iops_r_concurrent    = 0
                      + iops_wr_burst        = 0
                      + iops_wr_burst_length = 0
                      + iops_wr_concurrent   = 0
                      + linked_disk_id       = (known after apply)
                      + mbps_r_burst         = 0
                      + mbps_r_concurrent    = 0
                      + mbps_wr_burst        = 0
                      + mbps_wr_concurrent   = 0
                      + size                 = "32G"
                      + storage              = "data"
                    }
                }
            }
        }

      + network {
          + bridge    = "k3s"
          + firewall  = false
          + id        = 0
          + link_down = false
          + macaddr   = (known after apply)
          + model     = "virtio"
          + mtu       = 1400
        }
      + network {
          + bridge    = "vmbr2"
          + firewall  = false
          + id        = 1
          + link_down = false
          + macaddr   = (known after apply)
          + model     = "virtio"
        }

      + smbios (known after apply)
    }

  # proxmox_vm_qemu.k3s-manager-controller-2 will be updated in-place
  ~ resource "proxmox_vm_qemu" "k3s-manager-controller-2" {
      + bootdisk               = "scsi0"
      + default_ipv4_address   = (known after apply)
        id                     = "milky-carina/qemu/10001"
        name                   = "solufit-k3s-controller-2"
      + ssh_host               = (known after apply)
      + ssh_port               = (known after apply)
        tags                   = null
      ~ vm_state               = "stopped" -> "running"
        # (48 unchanged attributes hidden)

      - serial {
          - id   = 0 -> null
          - type = "socket" -> null
        }

        # (4 unchanged blocks hidden)
    }

  # proxmox_vm_qemu.k3s-manager-controller-3 will be created
  + resource "proxmox_vm_qemu" "k3s-manager-controller-3" {
      + additional_wait        = 5
      + agent                  = 1
      + automatic_reboot       = true
      + balloon                = 0
      + bios                   = "seabios"
      + boot                   = "order=scsi0"
      + bootdisk               = "scsi0"
      + ciupgrade              = false
      + clone                  = "ubuntu2204-withdocker"
      + clone_wait             = 10
      + cores                  = 4
      + cpu_type               = "host"
      + default_ipv4_address   = (known after apply)
      + default_ipv6_address   = (known after apply)
      + define_connection_info = true
      + desc                   = "Management Kubernetes cluster for Solufit"
      + force_create           = false
      + full_clone             = true
      + hotplug                = "network,disk,usb"
      + id                     = (known after apply)
      + ipconfig0              = "ip=10.100.0.12/24"
      + ipconfig1              = "ip=dhcp"
      + kvm                    = true
      + linked_vmid            = (known after apply)
      + memory                 = 8192
      + name                   = "solufit-k3s-controller-3"
      + onboot                 = false
      + os_type                = "cloud-init"
      + pool                   = "solufit"
      + protection             = false
      + reboot_required        = (known after apply)
      + scsihw                 = "virtio-scsi-pci"
      + skip_ipv4              = false
      + skip_ipv6              = false
      + sockets                = 1
      + ssh_forward_ip         = "10.100.0.12"
      + ssh_host               = (known after apply)
      + ssh_port               = (known after apply)
      + ssh_user               = "ubuntu"
      + sshkeys                = <<-EOT
            ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDHnxwb9bBqio0ljUF/PrZJ6rejcBZFegnKndwRz85p9YuijN0tI3vslgTDY9eek26WXc1CMECaSvMoMpV3CalrIELV2RoTfXZOCtxkaoJxZcBpBIWAoM77h5cVusZT0znx7a9wSW4rmqFXaEHc2BMkWNDnV1w6ykpycyTUECEOq/xYqCtgUwrfGR1/cb3XTpAPZVbaEoZPXU9JfH6TR+9uKoZF7tovmXmMUkpjUn/prVUEPYBMaMKAFedtBWL7kexdStDxArTgfOj3QG+e1DOZ1IAkmxeBKg3hkQ56ECAz25NtS0DJqAEVP4EqPmTYerlsEN1Ousiw6AVz6Pzpo4OIYrCzg83DZ4eKbMr1w7cM9d3YclRIqqDOHtGgOf55mITBCz3kgHO6Id6kU62XyEcA9rcQdixOZMMMvzCBKWCaUord0A0OjabtXPQ6BeG1LBdp2oCWd0dPhehrKUHjRVuH5DfXtUf/UkOP4ElnU70c0YkxWZTs8hC+7BybkOcGePk= yuuta@yuuta-ThinkPadE14
            
            ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQC6ahvrz1GH0KxZhCVNwxWB1WJTOGBccLXDCIECzzC2mG4anVCjeZ5kyHCSvO2smASACUOouthlXq7xDXFETE/coKVe0fSnU6ApTjMW9q4U9Bsjvcx2G4YENxbgJAaIYiA8Dw3Zw2fBQUIkhxOhXgwREK0xl98n880uzIZ3PFOUu+NvNu8SoJOiVq8vgdft2EWajADS9L1DRh8OR0CnQo/RsNdL6O4RnbPGJCHPMutLKbdsazMBzPjZ4DgqF88+rC5DaAEXPlAZ1mHriZDEOlYQoOFTSwKcaYfjJvONY9zSWYgdEY5lsrMpJWD3u9FuvyiWaNPClArcWOd4zvE1z+WWDPEfVSt+pe6eMubf9nZ1/RPsP8mugX2jOaMFdMjWN4gMk+d4i/9QbRQynlOhVWo1LwmE04QIJRw6k4TNcs6The5fdwLXvx9QWI7CwOpUxvc6CxaN109yZBc8Se0GdX4djPs97H4wYSdBX6pWoastC5ludVYXlE13zSOE76BAnes= yuuta@yuuta-ThinkPadE14
        EOT
      + tablet                 = true
      + tags                   = (known after apply)
      + target_node            = "milky-polaris"
      + unused_disk            = (known after apply)
      + vcpus                  = 0
      + vm_state               = "running"
      + vmid                   = 10002

      + disks {
          + ide {
              + ide0 {
                  + cloudinit {
                      + storage = "local-lvm"
                    }
                }
            }
          + scsi {
              + scsi0 {
                  + disk {
                      + backup               = true
                      + format               = "raw"
                      + id                   = (known after apply)
                      + iops_r_burst         = 0
                      + iops_r_burst_length  = 0
                      + iops_r_concurrent    = 0
                      + iops_wr_burst        = 0
                      + iops_wr_burst_length = 0
                      + iops_wr_concurrent   = 0
                      + linked_disk_id       = (known after apply)
                      + mbps_r_burst         = 0
                      + mbps_r_concurrent    = 0
                      + mbps_wr_burst        = 0
                      + mbps_wr_concurrent   = 0
                      + size                 = "32G"
                      + storage              = "data"
                    }
                }
            }
        }

      + network {
          + bridge    = "k3s"
          + firewall  = false
          + id        = 0
          + link_down = false
          + macaddr   = (known after apply)
          + model     = "virtio"
          + mtu       = 1400
        }
      + network {
          + bridge    = "vmbr2"
          + firewall  = false
          + id        = 1
          + link_down = false
          + macaddr   = (known after apply)
          + model     = "virtio"
        }

      + smbios (known after apply)
    }

  # proxmox_vm_qemu.k3s-manager-worker-1 will be created
  + resource "proxmox_vm_qemu" "k3s-manager-worker-1" {
      + additional_wait        = 5
      + agent                  = 1
      + automatic_reboot       = true
      + balloon                = 0
      + bios                   = "seabios"
      + boot                   = "order=scsi0"
      + bootdisk               = "scsi0"
      + ciupgrade              = false
      + clone                  = "ubuntu2204-withdocker"
      + clone_wait             = 10
      + cores                  = 4
      + cpu_type               = "host"
      + default_ipv4_address   = (known after apply)
      + default_ipv6_address   = (known after apply)
      + define_connection_info = true
      + desc                   = "Management Kubernetes cluster for Solufit"
      + force_create           = false
      + full_clone             = true
      + hotplug                = "network,disk,usb"
      + id                     = (known after apply)
      + ipconfig0              = "ip=10.100.0.20/24"
      + ipconfig1              = "ip=dhcp"
      + kvm                    = true
      + linked_vmid            = (known after apply)
      + memory                 = 4096
      + name                   = "solufit-k3s-worker-1"
      + onboot                 = false
      + os_type                = "cloud-init"
      + pool                   = "solufit"
      + protection             = false
      + reboot_required        = (known after apply)
      + scsihw                 = "virtio-scsi-pci"
      + skip_ipv4              = false
      + skip_ipv6              = false
      + sockets                = 1
      + ssh_forward_ip         = "10.100.0.20"
      + ssh_host               = (known after apply)
      + ssh_port               = (known after apply)
      + ssh_user               = "ubuntu"
      + sshkeys                = <<-EOT
            ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDHnxwb9bBqio0ljUF/PrZJ6rejcBZFegnKndwRz85p9YuijN0tI3vslgTDY9eek26WXc1CMECaSvMoMpV3CalrIELV2RoTfXZOCtxkaoJxZcBpBIWAoM77h5cVusZT0znx7a9wSW4rmqFXaEHc2BMkWNDnV1w6ykpycyTUECEOq/xYqCtgUwrfGR1/cb3XTpAPZVbaEoZPXU9JfH6TR+9uKoZF7tovmXmMUkpjUn/prVUEPYBMaMKAFedtBWL7kexdStDxArTgfOj3QG+e1DOZ1IAkmxeBKg3hkQ56ECAz25NtS0DJqAEVP4EqPmTYerlsEN1Ousiw6AVz6Pzpo4OIYrCzg83DZ4eKbMr1w7cM9d3YclRIqqDOHtGgOf55mITBCz3kgHO6Id6kU62XyEcA9rcQdixOZMMMvzCBKWCaUord0A0OjabtXPQ6BeG1LBdp2oCWd0dPhehrKUHjRVuH5DfXtUf/UkOP4ElnU70c0YkxWZTs8hC+7BybkOcGePk= yuuta@yuuta-ThinkPadE14
            
            ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQC6ahvrz1GH0KxZhCVNwxWB1WJTOGBccLXDCIECzzC2mG4anVCjeZ5kyHCSvO2smASACUOouthlXq7xDXFETE/coKVe0fSnU6ApTjMW9q4U9Bsjvcx2G4YENxbgJAaIYiA8Dw3Zw2fBQUIkhxOhXgwREK0xl98n880uzIZ3PFOUu+NvNu8SoJOiVq8vgdft2EWajADS9L1DRh8OR0CnQo/RsNdL6O4RnbPGJCHPMutLKbdsazMBzPjZ4DgqF88+rC5DaAEXPlAZ1mHriZDEOlYQoOFTSwKcaYfjJvONY9zSWYgdEY5lsrMpJWD3u9FuvyiWaNPClArcWOd4zvE1z+WWDPEfVSt+pe6eMubf9nZ1/RPsP8mugX2jOaMFdMjWN4gMk+d4i/9QbRQynlOhVWo1LwmE04QIJRw6k4TNcs6The5fdwLXvx9QWI7CwOpUxvc6CxaN109yZBc8Se0GdX4djPs97H4wYSdBX6pWoastC5ludVYXlE13zSOE76BAnes= yuuta@yuuta-ThinkPadE14
        EOT
      + tablet                 = true
      + tags                   = (known after apply)
      + target_node            = "milky-carina"
      + unused_disk            = (known after apply)
      + vcpus                  = 0
      + vm_state               = "running"
      + vmid                   = 11000

      + disks {
          + ide {
              + ide0 {
                  + cloudinit {
                      + storage = "local-lvm"
                    }
                }
            }
          + scsi {
              + scsi0 {
                  + disk {
                      + backup               = true
                      + format               = "raw"
                      + id                   = (known after apply)
                      + iops_r_burst         = 0
                      + iops_r_burst_length  = 0
                      + iops_r_concurrent    = 0
                      + iops_wr_burst        = 0
                      + iops_wr_burst_length = 0
                      + iops_wr_concurrent   = 0
                      + linked_disk_id       = (known after apply)
                      + mbps_r_burst         = 0
                      + mbps_r_concurrent    = 0
                      + mbps_wr_burst        = 0
                      + mbps_wr_concurrent   = 0
                      + size                 = "32G"
                      + storage              = "data"
                    }
                }
            }
        }

      + network {
          + bridge    = "k3s"
          + firewall  = false
          + id        = 0
          + link_down = false
          + macaddr   = (known after apply)
          + model     = "virtio"
          + mtu       = 1400
        }
      + network {
          + bridge    = "vmbr2"
          + firewall  = false
          + id        = 1
          + link_down = false
          + macaddr   = (known after apply)
          + model     = "virtio"
        }

      + smbios (known after apply)
    }

  # proxmox_vm_qemu.k3s-manager-worker-2 will be created
  + resource "proxmox_vm_qemu" "k3s-manager-worker-2" {
      + additional_wait        = 5
      + agent                  = 1
      + automatic_reboot       = true
      + balloon                = 0
      + bios                   = "seabios"
      + boot                   = "order=scsi0"
      + bootdisk               = "scsi0"
      + ciupgrade              = false
      + clone                  = "ubuntu2204-withdocker"
      + clone_wait             = 10
      + cores                  = 2
      + cpu_type               = "host"
      + default_ipv4_address   = (known after apply)
      + default_ipv6_address   = (known after apply)
      + define_connection_info = true
      + desc                   = "Management Kubernetes cluster for Solufit"
      + force_create           = false
      + full_clone             = true
      + hotplug                = "network,disk,usb"
      + id                     = (known after apply)
      + ipconfig0              = "ip=10.100.0.21/24"
      + ipconfig1              = "ip=dhcp"
      + kvm                    = true
      + linked_vmid            = (known after apply)
      + memory                 = 4096
      + name                   = "solufit-k3s-worker-2"
      + onboot                 = false
      + os_type                = "cloud-init"
      + pool                   = "solufit"
      + protection             = false
      + reboot_required        = (known after apply)
      + scsihw                 = "virtio-scsi-pci"
      + skip_ipv4              = false
      + skip_ipv6              = false
      + sockets                = 1
      + ssh_forward_ip         = "10.100.0.21"
      + ssh_host               = (known after apply)
      + ssh_port               = (known after apply)
      + ssh_user               = "ubuntu"
      + sshkeys                = <<-EOT
            ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDHnxwb9bBqio0ljUF/PrZJ6rejcBZFegnKndwRz85p9YuijN0tI3vslgTDY9eek26WXc1CMECaSvMoMpV3CalrIELV2RoTfXZOCtxkaoJxZcBpBIWAoM77h5cVusZT0znx7a9wSW4rmqFXaEHc2BMkWNDnV1w6ykpycyTUECEOq/xYqCtgUwrfGR1/cb3XTpAPZVbaEoZPXU9JfH6TR+9uKoZF7tovmXmMUkpjUn/prVUEPYBMaMKAFedtBWL7kexdStDxArTgfOj3QG+e1DOZ1IAkmxeBKg3hkQ56ECAz25NtS0DJqAEVP4EqPmTYerlsEN1Ousiw6AVz6Pzpo4OIYrCzg83DZ4eKbMr1w7cM9d3YclRIqqDOHtGgOf55mITBCz3kgHO6Id6kU62XyEcA9rcQdixOZMMMvzCBKWCaUord0A0OjabtXPQ6BeG1LBdp2oCWd0dPhehrKUHjRVuH5DfXtUf/UkOP4ElnU70c0YkxWZTs8hC+7BybkOcGePk= yuuta@yuuta-ThinkPadE14
            
            ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQC6ahvrz1GH0KxZhCVNwxWB1WJTOGBccLXDCIECzzC2mG4anVCjeZ5kyHCSvO2smASACUOouthlXq7xDXFETE/coKVe0fSnU6ApTjMW9q4U9Bsjvcx2G4YENxbgJAaIYiA8Dw3Zw2fBQUIkhxOhXgwREK0xl98n880uzIZ3PFOUu+NvNu8SoJOiVq8vgdft2EWajADS9L1DRh8OR0CnQo/RsNdL6O4RnbPGJCHPMutLKbdsazMBzPjZ4DgqF88+rC5DaAEXPlAZ1mHriZDEOlYQoOFTSwKcaYfjJvONY9zSWYgdEY5lsrMpJWD3u9FuvyiWaNPClArcWOd4zvE1z+WWDPEfVSt+pe6eMubf9nZ1/RPsP8mugX2jOaMFdMjWN4gMk+d4i/9QbRQynlOhVWo1LwmE04QIJRw6k4TNcs6The5fdwLXvx9QWI7CwOpUxvc6CxaN109yZBc8Se0GdX4djPs97H4wYSdBX6pWoastC5ludVYXlE13zSOE76BAnes= yuuta@yuuta-ThinkPadE14
        EOT
      + tablet                 = true
      + tags                   = (known after apply)
      + target_node            = "milky-polaris"
      + unused_disk            = (known after apply)
      + vcpus                  = 0
      + vm_state               = "running"
      + vmid                   = 11001

      + disks {
          + ide {
              + ide0 {
                  + cloudinit {
                      + storage = "local-lvm"
                    }
                }
            }
          + scsi {
              + scsi0 {
                  + disk {
                      + backup               = true
                      + format               = "raw"
                      + id                   = (known after apply)
                      + iops_r_burst         = 0
                      + iops_r_burst_length  = 0
                      + iops_r_concurrent    = 0
                      + iops_wr_burst        = 0
                      + iops_wr_burst_length = 0
                      + iops_wr_concurrent   = 0
                      + linked_disk_id       = (known after apply)
                      + mbps_r_burst         = 0
                      + mbps_r_concurrent    = 0
                      + mbps_wr_burst        = 0
                      + mbps_wr_concurrent   = 0
                      + size                 = "32G"
                      + storage              = "data"
                    }
                }
            }
          + virtio {
            }
        }

      + network {
          + bridge    = "k3s"
          + firewall  = false
          + id        = 0
          + link_down = false
          + macaddr   = (known after apply)
          + model     = "virtio"
          + mtu       = 1400
        }
      + network {
          + bridge    = "vmbr2"
          + firewall  = false
          + id        = 1
          + link_down = false
          + macaddr   = (known after apply)
          + model     = "virtio"
        }

      + smbios (known after apply)
    }

  # proxmox_vm_qemu.k3s-manager-worker-3 will be updated in-place
  ~ resource "proxmox_vm_qemu" "k3s-manager-worker-3" {
      + bootdisk               = "scsi0"
      + default_ipv4_address   = (known after apply)
        id                     = "milky-carina/qemu/11002"
      ~ memory                 = 2048 -> 4096
        name                   = "solufit-k3s-worker-3"
      + ssh_host               = (known after apply)
      + ssh_port               = (known after apply)
        tags                   = null
      ~ vm_state               = "stopped" -> "running"
        # (47 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # proxmox_vm_qemu.k8s-play-controller will be created
  + resource "proxmox_vm_qemu" "k8s-play-controller" {
      + additional_wait        = 5
      + agent                  = 1
      + automatic_reboot       = true
      + balloon                = 0
      + bios                   = "seabios"
      + boot                   = "order=scsi0"
      + bootdisk               = "scsi0"
      + ciupgrade              = false
      + clone                  = "ubuntu2204-withdocker"
      + clone_wait             = 10
      + cores                  = 4
      + cpu_type               = "host"
      + default_ipv4_address   = (known after apply)
      + default_ipv6_address   = (known after apply)
      + define_connection_info = true
      + desc                   = "Playground Kubernetes cluster for Solufit"
      + force_create           = false
      + full_clone             = true
      + hotplug                = "network,disk,usb"
      + id                     = (known after apply)
      + ipconfig0              = "ip=10.100.2.10/24"
      + ipconfig1              = "ip=dhcp"
      + kvm                    = true
      + linked_vmid            = (known after apply)
      + memory                 = 4096
      + name                   = "solufit-k8s-playground-controller"
      + onboot                 = false
      + os_type                = "cloud-init"
      + pool                   = "solufit"
      + protection             = false
      + reboot_required        = (known after apply)
      + scsihw                 = "virtio-scsi-pci"
      + skip_ipv4              = false
      + skip_ipv6              = false
      + sockets                = 1
      + ssh_forward_ip         = "10.100.2.10"
      + ssh_host               = (known after apply)
      + ssh_port               = (known after apply)
      + ssh_user               = "ubuntu"
      + sshkeys                = <<-EOT
            ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDHnxwb9bBqio0ljUF/PrZJ6rejcBZFegnKndwRz85p9YuijN0tI3vslgTDY9eek26WXc1CMECaSvMoMpV3CalrIELV2RoTfXZOCtxkaoJxZcBpBIWAoM77h5cVusZT0znx7a9wSW4rmqFXaEHc2BMkWNDnV1w6ykpycyTUECEOq/xYqCtgUwrfGR1/cb3XTpAPZVbaEoZPXU9JfH6TR+9uKoZF7tovmXmMUkpjUn/prVUEPYBMaMKAFedtBWL7kexdStDxArTgfOj3QG+e1DOZ1IAkmxeBKg3hkQ56ECAz25NtS0DJqAEVP4EqPmTYerlsEN1Ousiw6AVz6Pzpo4OIYrCzg83DZ4eKbMr1w7cM9d3YclRIqqDOHtGgOf55mITBCz3kgHO6Id6kU62XyEcA9rcQdixOZMMMvzCBKWCaUord0A0OjabtXPQ6BeG1LBdp2oCWd0dPhehrKUHjRVuH5DfXtUf/UkOP4ElnU70c0YkxWZTs8hC+7BybkOcGePk= yuuta@yuuta-ThinkPadE14
            
            ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQC6ahvrz1GH0KxZhCVNwxWB1WJTOGBccLXDCIECzzC2mG4anVCjeZ5kyHCSvO2smASACUOouthlXq7xDXFETE/coKVe0fSnU6ApTjMW9q4U9Bsjvcx2G4YENxbgJAaIYiA8Dw3Zw2fBQUIkhxOhXgwREK0xl98n880uzIZ3PFOUu+NvNu8SoJOiVq8vgdft2EWajADS9L1DRh8OR0CnQo/RsNdL6O4RnbPGJCHPMutLKbdsazMBzPjZ4DgqF88+rC5DaAEXPlAZ1mHriZDEOlYQoOFTSwKcaYfjJvONY9zSWYgdEY5lsrMpJWD3u9FuvyiWaNPClArcWOd4zvE1z+WWDPEfVSt+pe6eMubf9nZ1/RPsP8mugX2jOaMFdMjWN4gMk+d4i/9QbRQynlOhVWo1LwmE04QIJRw6k4TNcs6The5fdwLXvx9QWI7CwOpUxvc6CxaN109yZBc8Se0GdX4djPs97H4wYSdBX6pWoastC5ludVYXlE13zSOE76BAnes= yuuta@yuuta-ThinkPadE14
        EOT
      + tablet                 = true
      + tags                   = (known after apply)
      + target_node            = "milky-capella"
      + unused_disk            = (known after apply)
      + vcpus                  = 0
      + vm_state               = "running"
      + vmid                   = 31000

      + disks {
          + ide {
              + ide0 {
                  + cloudinit {
                      + storage = "local-lvm"
                    }
                }
            }
          + scsi {
              + scsi0 {
                  + disk {
                      + backup               = true
                      + format               = "raw"
                      + id                   = (known after apply)
                      + iops_r_burst         = 0
                      + iops_r_burst_length  = 0
                      + iops_r_concurrent    = 0
                      + iops_wr_burst        = 0
                      + iops_wr_burst_length = 0
                      + iops_wr_concurrent   = 0
                      + linked_disk_id       = (known after apply)
                      + mbps_r_burst         = 0
                      + mbps_r_concurrent    = 0
                      + mbps_wr_burst        = 0
                      + mbps_wr_concurrent   = 0
                      + size                 = "32G"
                      + storage              = "main-storage"
                    }
                }
            }
        }

      + network {
          + bridge    = "k8splay"
          + firewall  = false
          + id        = 0
          + link_down = false
          + macaddr   = (known after apply)
          + model     = "virtio"
          + mtu       = 1400
        }
      + network {
          + bridge    = "vmbr2"
          + firewall  = false
          + id        = 1
          + link_down = false
          + macaddr   = (known after apply)
          + model     = "virtio"
        }

      + smbios (known after apply)
    }

  # proxmox_vm_qemu.k8s-play-manager-ansible-host must be replaced
-/+ resource "proxmox_vm_qemu" "k8s-play-manager-ansible-host" {
      + bootdisk               = "scsi0"
      - cicustom               = "vendor=cephfs:snippets/ansible-host-cloud-config.yaml" -> null # forces replacement
      + default_ipv4_address   = (known after apply)
      + default_ipv6_address   = (known after apply)
      ~ id                     = "milky-polaris/qemu/30000" -> (known after apply)
      ~ linked_vmid            = 0 -> (known after apply)
        name                   = "k8s-play-ansible-host"
      - numa                   = false -> null
      - qemu_os                = "other" -> null
      ~ reboot_required        = false -> (known after apply)
      + ssh_host               = (known after apply)
      + ssh_port               = (known after apply)
      + tags                   = (known after apply)
      ~ target_node            = "milky-capella" -> "milky-carina"
      ~ unused_disk            = [] -> (known after apply)
      ~ vm_state               = "stopped" -> "running"
        # (42 unchanged attributes hidden)

      ~ disks {
          ~ scsi {
              ~ scsi0 {
                  ~ disk {
                      - discard              = false -> null
                      - emulatessd           = false -> null
                      ~ id                   = 0 -> (known after apply)
                      - iothread             = false -> null
                      ~ linked_disk_id       = -1 -> (known after apply)
                      - readonly             = false -> null
                      - replicate            = false -> null
                      ~ storage              = "local-lvm" -> "main-storage"
                        # (17 unchanged attributes hidden)
                    }
                }
            }

            # (1 unchanged block hidden)
        }

      ~ network {
            id        = 0
          ~ macaddr   = "bc:24:11:8d:70:d7" -> (known after apply)
          - queues    = 0 -> null
          - rate      = 0 -> null
          - tag       = 0 -> null
            # (5 unchanged attributes hidden)
        }
      ~ network {
            id        = 1
          ~ macaddr   = "bc:24:11:ad:73:a9" -> (known after apply)
          - mtu       = 0 -> null
          - queues    = 0 -> null
          - rate      = 0 -> null
          - tag       = 0 -> null
            # (4 unchanged attributes hidden)
        }

      ~ smbios {
          + additional_wait             = (known after apply)
          + agent                       = (known after apply)
          + agent_timeout               = (known after apply)
          + args                        = (known after apply)
          + automatic_reboot            = (known after apply)
          + balloon                     = (known after apply)
          + bios                        = (known after apply)
          + boot                        = (known after apply)
          + bootdisk                    = (known after apply)
          + ci_wait                     = (known after apply)
          + cicustom                    = (known after apply)
          + cipassword                  = (known after apply)
          + ciupgrade                   = (known after apply)
          + ciuser                      = (known after apply)
          + clone                       = (known after apply)
          + clone_id                    = (known after apply)
          + clone_wait                  = (known after apply)
          + cores                       = (known after apply)
          + cpu                         = (known after apply)
          + cpu_type                    = (known after apply)
          + default_ipv4_address        = (known after apply)
          + default_ipv6_address        = (known after apply)
          + define_connection_info      = (known after apply)
          + desc                        = (known after apply)
          + force_create                = (known after apply)
          + force_recreate_on_change_of = (known after apply)
          + full_clone                  = (known after apply)
          + hagroup                     = (known after apply)
          + hastate                     = (known after apply)
          + hotplug                     = (known after apply)
          + id                          = (known after apply)
          + ipconfig0                   = (known after apply)
          + ipconfig1                   = (known after apply)
          + ipconfig10                  = (known after apply)
          + ipconfig11                  = (known after apply)
          + ipconfig12                  = (known after apply)
          + ipconfig13                  = (known after apply)
          + ipconfig14                  = (known after apply)
          + ipconfig15                  = (known after apply)
          + ipconfig2                   = (known after apply)
          + ipconfig3                   = (known after apply)
          + ipconfig4                   = (known after apply)
          + ipconfig5                   = (known after apply)
          + ipconfig6                   = (known after apply)
          + ipconfig7                   = (known after apply)
          + ipconfig8                   = (known after apply)
          + ipconfig9                   = (known after apply)
          + kvm                         = (known after apply)
          + linked_vmid                 = (known after apply)
          + machine                     = (known after apply)
          + memory                      = (known after apply)
          + name                        = (known after apply)
          + nameserver                  = (known after apply)
          + numa                        = (known after apply)
          + onboot                      = (known after apply)
          + os_network_config           = (known after apply)
          + os_type                     = (known after apply)
          + pool                        = (known after apply)
          + protection                  = (known after apply)
          + pxe                         = (known after apply)
          + qemu_os                     = (known after apply)
          + reboot_required             = (known after apply)
          + scsihw                      = (known after apply)
          + searchdomain                = (known after apply)
          + skip_ipv4                   = (known after apply)
          + skip_ipv6                   = (known after apply)
          + sockets                     = (known after apply)
          + ssh_forward_ip              = (known after apply)
          + ssh_host                    = (known after apply)
          + ssh_port                    = (known after apply)
          + ssh_private_key             = (known after apply)
          + ssh_user                    = (known after apply)
          + sshkeys                     = (known after apply)
          + startup                     = (known after apply)
          + tablet                      = (known after apply)
          + tags                        = (known after apply)
          + target_node                 = (known after apply)
          + target_nodes                = (known after apply)
          + unused_disk                 = (known after apply)
          + vcpus                       = (known after apply)
          + vm_state                    = (known after apply)
          + vmid                        = (known after apply)
        } -> (known after apply)
    }

  # proxmox_vm_qemu.k8s-play-worker will be updated in-place
  ~ resource "proxmox_vm_qemu" "k8s-play-worker" {
      + bootdisk               = "scsi0"
      + default_ipv4_address   = (known after apply)
        id                     = "milky-polaris/qemu/32000"
        name                   = "solufit-k8s-playground-worker"
      + ssh_host               = (known after apply)
      + ssh_port               = (known after apply)
        tags                   = null
      ~ vm_state               = "stopped" -> "running"
        # (48 unchanged attributes hidden)

      ~ disks {
          ~ scsi {
              ~ scsi0 {
                  ~ disk {
                        id                   = 0
                      ~ storage              = "local-lvm" -> "main-storage"
                        # (23 unchanged attributes hidden)
                    }
                }
            }
          - virtio {
              - virtio0 {
                  - disk {
                      - backup               = true -> null
                      - discard              = false -> null
                      - format               = "raw" -> null
                      - id                   = 0 -> null
                      - iops_r_burst         = 0 -> null
                      - iops_r_burst_length  = 0 -> null
                      - iops_r_concurrent    = 0 -> null
                      - iops_wr_burst        = 0 -> null
                      - iops_wr_burst_length = 0 -> null
                      - iops_wr_concurrent   = 0 -> null
                      - iothread             = false -> null
                      - linked_disk_id       = -1 -> null
                      - mbps_r_burst         = 0 -> null
                      - mbps_r_concurrent    = 0 -> null
                      - mbps_wr_burst        = 0 -> null
                      - mbps_wr_concurrent   = 0 -> null
                      - readonly             = false -> null
                      - replicate            = false -> null
                      - size                 = "32G" -> null
                      - storage              = "main" -> null
                        # (4 unchanged attributes hidden)
                    }
                }
            }

            # (1 unchanged block hidden)
        }

        # (3 unchanged blocks hidden)
    }

Plan: 11 to add, 5 to change, 9 to destroy.

Warning: Missing resource schema from provider

No resource schema found for local_file when decoding prior state

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>


*Pushed by: @Walkmana-25, Action: `pull_request`*